{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Liber Moronica",
    "description": "",
    "home_page_url": "https://funbunggo.github.io/funbunggo",
    "feed_url": "https://funbunggo.github.io/funbunggo/feed.json",
    "user_comment": "",
    "author": {
        "name": "Funbunggo"
    },
    "items": [
        {
            "id": "https://funbunggo.github.io/funbunggo/thoughts-on-the-game-awards-2025.html",
            "url": "https://funbunggo.github.io/funbunggo/thoughts-on-the-game-awards-2025.html",
            "title": "Thoughts On The Game Awards 2025",
            "summary": "Note: In the midst of writing, I learned that there has been an attempt to trademark “The Game Awards”, which has significantly damaged the benefit of the doubt that I gave to Geoff Keighley in this post. However I am too lazy to change what&hellip;",
            "content_html": "<p><em><span style=\"font-weight: 400;\">Note: In the midst of writing, I learned that there has been an attempt to </span><a href=\"https://80.lv/articles/geoff-keighley-wants-to-trademark-the-game-awards/\"><span style=\"font-weight: 400;\">trademark “The Game Awards”</span></a><span style=\"font-weight: 400;\">, which has significantly damaged the benefit of the doubt that I gave to Geoff Keighley in this post. However I am too lazy to change what I’ve already written, so just keep this in mind. Also, this is not about the awards or who should have won/been nominated.</span></em></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Whenever December rolls around, I can’t help but feel a sense of excitement and joy to a degree which I find really weird once the month ends and my emotions have reset to normal levels. I attribute this to the end of the semester, and the most wonderful event that graces humanity once a year: the Game Awards.</span></p>\n<p><span style=\"font-weight: 400;\">All jokes aside, I do enjoy TGA and have been tuning in to the livestreams ever since 2021 when Hazelight’s “It Takes Two” won GOTY. For four years I’ve been filling up my friend group’s Discord server with live updates on the upcoming releases and the winners from each category, trading thoughts with whoever was awake on what we would be hoping to see win or what we thought we would enjoy from the releases and announcements.</span></p>\n<p><span style=\"font-weight: 400;\">Needless to say, TGA is something I look forward to every year and I still see it as a celebration of video games even with all its flaws, which it seems to be trying to resolve somehow.</span></p>\n<p><span style=\"font-weight: 400;\">As a preface, I’m not really one to complain about the ads and the release trailers too much: it’s a for-profit show so it needs advertisements to break even, and my only major grievances with the announcements is that while many of them are a spectacle to watch, they don’t show any gameplay. I would also like to say that while I do think Geoff Keighley is a bit of a shill (I am being polite about it) and that much of the scathing critiques about how he runs the show are ultimately correct, he still has it in him to </span><i><span style=\"font-weight: 400;\">care</span></i><span style=\"font-weight: 400;\"> about video games.</span></p>\n<p><span style=\"font-weight: 400;\">However, I think that this year’s TGA (which also serves as its tenth year anniversary) was perhaps the best TGA show of all time, in part because Keighley </span><i><span style=\"font-weight: 400;\">cared </span></i><span style=\"font-weight: 400;\">and listened to the criticisms that were rightfully thrown his way. While TGA is still far from perfect, I hope that this year has set the path for a better show that truly celebrates the people behind the games we love.</span></p>\n<p><br><br></p>\n<h1><strong>What Went Wrong with 2023’s Game Awards</strong></h1>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Last year was a phenomenal year for gaming releases. Heavy emphasis on that last word, </span><i><span style=\"font-weight: 400;\">releases</span></i><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">To claim that the year was an overall success for the industry would ignore the fact that an estimated </span><a href=\"https://www.statista.com/statistics/1458214/worldwide-gaming-industry-layoffs/\"><span style=\"font-weight: 400;\">11,250 employees were laid off in 2023</span></a><span style=\"font-weight: 400;\">, a sharp rise from the previous year’s 8,500. Thus, the silence from Keighley on these issues had many people (myself included) confused and even upset.</span></p>\n<p><span style=\"font-weight: 400;\">It didn’t help that the show itself seemed to be shafting the people who made the games in favor of big-time celebrity names; while Matthew McConaughey was given time to ramble on about a future project he was involved in and Timothy Chalamet (whose connection to the industry is at best, an old YouTube channel for modded Xbox controllers) got to present GOTY, Neil Newbon’s acceptance speech for Best Performance was infamously cut short and Swen Vincke was told to </span><a href=\"https://insider-gaming.com/geoff-keighley-shows-cowardice-at-the-game-awards/\"><span style=\"font-weight: 400;\">“Wrap It Up”</span></a><span style=\"font-weight: 400;\"> during his speech for Baldur’s Gate 3’s victory which he dedicated to a colleague that passed away.</span></p>\n<p><span style=\"font-weight: 400;\">I will not mince my words here. It was disrespectful that any of that occurred, and while I am glad that things changed for the better with TGA, none of that should have happened in the first place. But here we are, and I will commend the fact that Keighley seems to have taken all the critique to heart. I hope I am not proven wrong about this.</span></p>\n<p><br><br></p>\n<h1><strong>What Was Better in 2024’s Game Awards</strong></h1>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Admittedly, while I was looking forward to the releases, I had dour expectations for the show itself. And then, Statler and Waldorf showed up. </span></p>\n<p><span style=\"font-weight: 400;\">Kidding aside, I was not expecting to enjoy the heckling segments as much as I did. In a way, it was a little cathartic to hear those two muppets making fun of Keighley and calling him a sell-out and poking fun at his bromance with Hideo Kojima. I’m sure Keighley may have had </span><i><span style=\"font-weight: 400;\">some</span></i><span style=\"font-weight: 400;\"> knowledge of what they were going to say, but I thought the jokes were well-written in classic Statler and Waldorf fashion. However, I wouldn’t be writing so positively about TGA 2025 if all that changed was that they included self-deprecation.</span></p>\n<p><span style=\"font-weight: 400;\">Among the many changes was the addition of a Game Changers award to celebrate those who positively impacted the industry. Keighley began this segment with a short acknowledgement that TGA hasn’t really addressed the layoff issue, before they played a video that described the work of Amir Satvat in compiling resources for laid off developers and helping around three thousand of them back on their feet.</span></p>\n<p><span style=\"font-weight: 400;\">Is this a sufficient acknowledgement of the issues faced by game developers and those involved in the industry? I don’t think so. Will Satvat’s work single handedly solve the ever increasing number of layoffs? No. But nevertheless, I believe that honoring the work of those attempting to improve the state of the industry is important in encouraging others to do the same. This does not mean that strong systemic change does not need to happen, but rather </span><i><span style=\"font-weight: 400;\">both</span></i><span style=\"font-weight: 400;\"> should be pursued.</span></p>\n<p><strong>A Sidenote on Satvat</strong></p>\n<p><a href=\"https://www.thegamer.com/the-game-awards-game-changer-winner-responds-hateful-comments/\"><span style=\"font-weight: 400;\">It was recently brought to public attention that Satvat works for Tencent</span></a><span style=\"font-weight: 400;\">, and thus his motives have come under scrutiny. I believe that it was dishonest of TGA to portray him as being “some guy” who wanted to do an altruistic act, but I genuinely believe that </span><strong>Satvat had good intentions</strong><span style=\"font-weight: 400;\"> with his work. As per his own statement, he was not involved in any mergers/acquisitions and was not even a Tencent employee at the time when he began his project. I can’t think of any way that this venture would have been profitable for him, so I am led to believe that he simply wanted to help others rather than him being some conniving industry plant.</span></p>\n<p> </p>\n<h1><strong>What Was Better in 2024’s Game Awards (cont’d)</strong></h1>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Another thing that I noticed was that they handled the appearance of Celebrity Presenters better than last year. This is less in regards to their number (after all, in cases like presenting Best Adaptation or discussing your upcoming release with a big-name actor as the lead you kind of </span><i><span style=\"font-weight: 400;\">have</span></i><span style=\"font-weight: 400;\"> to use the celebrity) and more to do with how they were used; Twitch streamer Snoop Dogg was not there to simply take up space, but aside from promoting the studio he co-founded with his son he performed a new song of his and the classic “Gin and Juice”; and how could they do an Indiana Jones segment without Harrison Ford himself? Compare that with having Anthony Mackie present “Best Ongoing” or the previously mentioned Timothy Chalamet presenting GOTY? Celebrity guests are fine if they’re naturally integrated into the show rather than shoving them in and expecting us to fawn over them and open up our wallets.</span></p>\n<p><span style=\"font-weight: 400;\">Celebs aside, we saw a wonderful slew of presenters (except for Randy Pitchford) with familiar faces ranging from creatives in the industry such as Abubakar Salim and Rebbeca Ford, to winners from previous years like Sam Lake, Josef Farez, and Swen Vincke; and of course, it wouldn’t be TGA without Hideo Kojima, and even this year’s appearance was a step up from last year in my opinion. Even the Spokesperson of Super Earth (played by Craig Lee Thomas) showed up to announce a new Helldivers update. It was nice to see these announcements from the people who’ve won our hearts with their work, and it was even better to hear them speak so passionately about the industry they work within.</span></p>\n<p> </p>\n<h1><strong>Wrapping It Up</strong></h1>\n<p> </p>\n<p><span style=\"font-weight: 400;\">The ten year anniversary show for The Game Awards was something unique. Alongside the usual announcements and previews, there were acknowledgements of the industry’s issues from the presenters and even from TGA itself as they introduced a new category that will hopefully inspire many more within the industry to help one another. While this is no remedy for collective action and unionization, to provide a platform with which to discuss these issues in front of millions of people is in my eyes, a net positive.</span></p>\n<p><span style=\"font-weight: 400;\">To close off, I would like to highlight </span><a href=\"https://www.youtube.com/watch?v=YvRm4HKK4gQ\"><span style=\"font-weight: 400;\">the words of Swen Vincke</span></a><span style=\"font-weight: 400;\">, who was finally given the chance to talk. When Vincke gave his speech as presenter for GOTY 2024, he seemed to be speaking for both the developers and the fans of video games. He rightfully called out the layoffs and the constant cash-grabbing that corpo suits force onto their games in hopes of affording another car for their vintage collection. He spoke the evergreen truth that when developers aren’t overworked and underpaid, given time to perfect their projects, and don’t have to worry about losing their job within the year, what emerges is something beautiful.</span></p>\n<p><span style=\"font-weight: 400;\">The corrosive spirit of profit-chasing is rampant in so many aspects of life, and while Vincke is but another person pointing it out, to be able to call it out in a room where those who embody this spirit the most will </span><i><span style=\"font-weight: 400;\">definitely hear it</span></i><span style=\"font-weight: 400;\"> is certainly worth noting. Maybe if we’re lucky, the next Muppets segment will be Keighley yelling out passages of Das Kapital in an argument with Sam the Eagle.</span></p>",
            "author": {
                "name": "Funbunggo"
            },
            "tags": [
            ],
            "date_published": "2024-12-20T20:05:25+08:00",
            "date_modified": "2024-12-20T20:05:25+08:00"
        },
        {
            "id": "https://funbunggo.github.io/funbunggo/the-scholar-and-the-all-knowing.html",
            "url": "https://funbunggo.github.io/funbunggo/the-scholar-and-the-all-knowing.html",
            "title": "The Scholar and the All-Knowing",
            "summary": "This story was written for the Soulstober 2024/Soulstober Stories art challenge The sky was an ominous gray, with patches from which the glow of the burning Erdtree shone through. All around him, Ziton the Scholar saw naught but the pale ash that drowned the city&hellip;",
            "content_html": "<p class=\"align-center\"><em><span style=\"text-decoration: underline;\">This story was written for the Soulstober 2024/Soulstober Stories art challenge</span></em></p>\n<p><span style=\"font-weight: 400;\">The sky was an ominous gray, with patches from which the glow of the burning Erdtree shone through. All around him, Ziton the Scholar saw naught but the pale ash that drowned the city of Leyndell. Above him, amidst the cinders that danced in the air like the smoldering butterflies of Mt. Gelmir, was that wispy golden trail that guided him everywhere, this time pointing to an unsullied staircase. With little else left to do, he climbed it and rode the lift upwards. Another damned set of stairs awaited him, though he had slowed his pace this time.</span></p>\n<p><i><span style=\"font-weight: 400;\">This is it, isn’t it?</span></i></p>\n<p><span style=\"font-weight: 400;\">When he rose from his grave, he had never envisioned that Lordship was to become his fate. He stared at his gloves of metal scales and black leather, a reminder of his past life; a hunter of tarnished who had lost the blessing of grace, and whence it returned the killer sought to play a scholar, then a Lord. And yet he had only come so far by spilling the blood of men and demigods alike. Perhaps he truly was nothing more than a murderer, only now he’d sharpened his mind to match the edge of his blade. Even as he climbed up the steps of Leyndell with the Erdtree burning in the far distance, the former confessor could just barely believe what he had done to the world, and what he was soon to do to it.</span></p>\n<p><span style=\"font-weight: 400;\">Finally reaching the top of the stairs, he felt at ease upon seeing a familiar face at the center of the chamber, arms outstretched and scepter in hand. Admittedly, he had little reason to call Sir Gideon Ofnir a friend any longer, but the great blasphemy still weighed heavily upon his soul and companionship was scarce to be found in the final moments of the world. When he returned to the Roundtable Hold, the only people who remained were poor Roderika and Hewg, whose mind was beginning to slip away from him. Everyone else had died or fled elsewhere, and Ziton was ashamed to admit that he had played a part in some of them.</span></p>\n<p><span style=\"font-weight: 400;\">He had seen to D’s death unwittingly as a pawn of the Lady Fia, and it was he who cut down both the Sorcerer Rogier and that vile Dung Eater, though the former was hardly himself in that strange realm of Death, and he was loath to refer to the latter as companion in any noble sense of the word. Truthfully, it was only Ensha whom he’d meant to kill, yet he knew the man far too little to mourn him nor curse his name once the blood had been spilled. The only ones he hadn’t killed had been Nepheli whom he’d handed the ashes of a stormhawk; Corhyn who he’d last seen laughing madly over the corpse of his once idol Goldmask; and finally, Gideon, who stood in front of him with arms wide open.</span></p>\n<p><span style=\"font-weight: 400;\">He called out to him, but the All-Knowing merely stood still and droned on about Queen Marika and an eternal struggle, and many other things that only confused Ziton. What had happened to old Gideon Ofnir? First, he’d become a monster in his pursuit to fix the world, trampling on those poor Albinaurics and abandoning his daughter; now, he was a shell of a man and a pitiable thing that lacked what remaining dignity and aspirations that even the monstrous Gideon held.</span></p>\n<p><span style=\"font-weight: 400;\">Ziton knew that he would not be granted passage without a fight, and as Gideon lifted up his scepter Ziton had taken the staff from his belt and in his other hand he held a seal of the Golden Order; though he carried with him a fine dagger of erdsteel and a pilfered crossbow from the Land of Shadow, the former remained in its sheath and the latter upon his back. Soured memories be damned, he was determined to do justice by his old mentor and grant him death at the hands of a fellow seeker of knowledge. The smell of ozone filled the air as the All-Knowing sent forth a great blue beam of a comet that the Scholar had only narrowly avoided. He returned fire with a cluster of twelve dark stars which chased Gideon, and as he focused his efforts on dodging the stars he failed to notice Ziton running towards him, his own staff raised high in the air. Cerulean energies surrounded its tip, swirling and binding together to form a mighty gavel which he slammed unto Gideon, knocking him prone and cracking some of his armor.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">To his surprise, Gideon had gotten up quickly and fell into a chant, catching the careless Scholar in an eruption of black flame that enveloped his body and forced Ziton to throw aside the hat he’d taken from Rogier after his passing. The pain of the black fire was great but only for a moment, before all sensation had disappeared and only numbness remained. When the flames died down and his vision had returned to him, Ziton saw above him the All-Knowing surrounded by the spectral petals of a scarlet lotus that was all too familiar. He raised high in the air his mighty seal and called upon the power of the ancient dragons; a hail of red lightning fell from the sky, and though Gideon writhed in pain with each bolt that struck him, he did not relent and the deathly bud did not dissipate.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">As the All-Knowing began his swift descent, Ziton made a vain attempt to flee to a far corner of the chamber. Gideon landed, dazed and prone on the floor as the flower bloomed, its spectral petals unfurling in a vibrant explosion and scattering a vile red pollen in the air that stung his nose. The sight of his old mentor struggling to get on his feet sent Ziton into a charge, black staff in both hands as he channeled glintstone through it once more. He could feel small strips of flesh sloughing off of his person with each step, but he neither faltered nor stumbled in his advance. This time, he wielded the icy projection of a longsword which he swung with ferocity at the staggered Gideon; not once did the blade itself strike gideon, but the wave of ice it sent forth had cracked the centerpiece of his armor and exposed the padding beneath it.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Ziton continued to swing ‘til the sword began to fade and all his magic had been spent, and he took Gideon’s sheathing of his own staff to mean that he too had exhausted himself. Neither man looked like the erudite gentlemen that they had been during their first meeting or even before their battle began. The All-Knowing’s armor had been shattered in several places, the exposed flesh once pallid now black with frostbite or bruises; though the Scholar’s armor seemed to be much more intact, he was far more unsightly with near visible bones as the rot slowly stripped from him his flesh, and what little of it that remained was touched and scarred by the black flame.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Gideon, now back on his feet, began to approach Ziton.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">“Give up! Ambition has been your folly, our folly! We—”</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Whatever his next words were to be, they merely died on his lips as Ziton unloaded a volley of bolts into his former mentor, each landing and tearing through flesh and battered armor with ease. The final bolt lodged itself in Gideon’s throat, and the last words of the All-Knowing would fall from his mouth as a wet and unintelligible gurgle before he collapsed upon the floor. </span></p>\n<p><span style=\"font-weight: 400;\">Ziton too, fell, resting on his knees as he took in the sight of his greatest teacher, dead by his own hands and with a lunatic’s despair writ across his wide open eyes. To think that this man was once a noble sage, that one could fall victim to their own hunger for justice only to reach the end of their life a blubbering fool with neither heart nor spirit. Ziton laughed, for he was no better; a bloodthirsty fanatic who sought redemption through wisdom and study, and yet for all the knowledge he’d gathered from the ancient tomes and scrolls, he could never purge the assassin’s instinct from his soul. This time, it had possessed him, and once again he had fallen back on his old ways as a killer and a craven. Could a man so faulty in his convictions truly bring order to the Lands Between?</span></p>\n<p><span style=\"font-weight: 400;\">The scholar looked up, and surely enough that damned trail of light was there once more to lead him onwards. Craven, killer, seeker, scholar; Ziton had been bestowed many titles throughout his life, all earned through acts both vicious and valorous. He had known grace, lost it, and once more it returned to him and set him upon the path of knowledge. Grace had been his guiding light, and perhaps his true mentor. And now it called upon him once more to lay claim to another title; that of the Elden Lord.</span></p>",
            "author": {
                "name": "Funbunggo"
            },
            "tags": [
            ],
            "date_published": "2024-11-03T01:02:20+08:00",
            "date_modified": "2024-11-03T01:02:20+08:00"
        },
        {
            "id": "https://funbunggo.github.io/funbunggo/retirement-2.html",
            "url": "https://funbunggo.github.io/funbunggo/retirement-2.html",
            "title": "Retirement",
            "summary": "This story was originally intended for The Mountains &amp; the Valleys zine, but unfortunately I had not finished the story in time. The stars were plentiful and beamed brightly against the backdrop of the night’s sky, though they brought no joy to Barristan as he&hellip;",
            "content_html": "<p class=\"align-center\"><span style=\"text-decoration: underline;\"><em>This story was originally intended for The Mountains &amp; the Valleys zine, but unfortunately I had not finished the story in time.</em></span></p>\n<p><span style=\"font-weight: 400;\">The stars were plentiful and beamed brightly against the backdrop of the night’s sky, though they brought no joy to Barristan as he gazed upon them through the hole in the Sanitarium roof. Though it pained his chest to do so, he gave way to a coughing fit as his lungs could take no more of the dreadful air which had grown thick with the scent of smoke, sulfur, and blood.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">“At least the Hamlet is safe,” he grumbled to himself softly so as not to wake Missandei who was fast asleep on the bed to his left. She was badly wounded, even moreso than he; the nurses and Paracelsus had spent the better part of the past two hours carefully extracting shards of shrapnel and debris from her flesh, and her face was a host to unsightly burns that they had quickly hidden away with bandages. To his right was Amani, whose leg sat in a splint courtesy of a crumbling rooftop. Sharing the room with them, he recognized a bandaged Reynauld and a scorched Bigby alongside a few others whose names he did not know, perhaps some of the brave but foolhardy townsfolk who’d fought alongside them against the Vvulf’s men. The old man sat up, and found that all of them had resigned themselves to slumber.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Barristan felt uneasy looking at all of them, almost nauseous, though he would not allow himself that indignity as his comrades laid beside him far worse for wear than he. Still, the sight of the wounded in their beds was like a specter to him, a buried corpse that had emerged from the earth time and time again to haunt him no matter how deep he dug its grave. These few were merely the newest among a cohort of bloodied faces with names he half-remembered or worse, stripped from his memory by the cruel hand of Father Time. Their cries for directive echoed in his mind, and so did his commands from all those years ago.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Missandei and Amani had followed his orders too. While Dismas and a handful of others faced the Vvulf, those that remained were tasked with dispatching the rest of the brigands and rescuing those helpless denizens who had not been able to flee the Hamlet in time. It was he who had decided to search that damned house; maybe a second eye would have allowed him to spot the trap laid by those damned raiders. Now, Missandei was grievously injured and the doctors feared the possibility that Amani may never dance again. It was the fool Sarmenti who emerged from that house with naught but a few gashes and helped him carry the others to safety; now he was with the others helping to rebuild what the bandits had torn down while he wasted away atop a bed.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><i><span style=\"font-weight: 400;\">My age and my misfortunes have begun to mount, perhaps it is time.</span></i></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">The old commander had spent nearly two thirds of his life on the battlefield, from the petty squabbles of feuding lords to the greater war for the fate of humanity itself. His shield had been the rock upon which many a fiendish blade had been broken, and he was proud to know that he had been a savior to many; he had also seen countless men and women die, many by his mace and far too many by his foolish words. Soon he was to be sixty years of age, and he feared his wits would only dull and his joints would grow stiff with the passage of time. How long before a careless order sees to the death of one of his comrades? Or worse, that he should burden an expedition and some well-meaning sap would throw themselves between Barristan and his assailant, taking a killing blow so that the old commander may live another day to bark death at the warriors of the Hamlet. It was decided: by the morrow he shall speak to their employer and arrange for his retirement, perhaps aid them in finding a suitable candidate for his replacement before taking leave of the Hamlet so that he may see to the end of his life in peace. There was no place here for a crestfallen old sod like himself.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Barristan did not dream that night, and his slumber was broken just as abruptly as it had taken him in the first place. It was a scream from outside that had woken him up, the shriek of a young child. He looked around and the room was nearly empty, save for two townsfolk fast asleep and far too injured to be of use had they been awake. The old man leapt from his bed, grabbing only his shield as he made for the stairs. Soreness be damned, he was not to stand idle while a child is being hurt. He slammed into the door and knocked it open, shield raised and his free hand drawn back to deliver a mighty blow. There were no brigands, no ghouls, no creatures of the dark waiting for him: instead, he saw William and Fergus chasing down a gaggle of youngsters with wooden swords in their hands, smiling and screaming as they tried to avoid the playful hound and her master.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">“Calm down old man, I know it’s been centuries since you were a child but they do tend to be loud when they play,”</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">A hand clapped him on the shoulder, and he turned to find himself facing a grinning Sarmenti. He seldom saw the man in plainclothes, but that mocking tone was unmistakably that of a court jester’s. Barristan stood, flummoxed and slack-jawed. He had questions, and Sarmenti had sensed this as he interjected before the old commander could respond.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">“Missi and Mani are training the new arrivals. To your surprise, you’ll find Reynauld and Bigby in the abbey. Not quite sure ‘bout the others, but I am not their keeper so what do I care?”</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Barristan remained where he stood as he took in the scene around him; he could scarcely recall the last time the Hamlet was this busy, as what seemed to be all but the incapable among its denizens lending themselves each to its reconstruction. Each group that passed him by seemed to be carrying wooden planks, stone bricks, or some other construction material. He noticed that a small crowd surrounded the tavern, each soul on the roof or on its walls working their hardest to see the Hamlet’s most beloved institution standing proudly once again.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Seeing that all was well, the rush of battle faded from his mind and the pain of his injuries began to set in. He placed one hand over his knee and the other on his abdomen as he hunched over, wincing in pain. Without hesitation, Sarmenti ducked and took the arm on Barristan’s knee and slung it across his shoulder.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">“All right, let’s get you back to bed before the nurses—or Light help me, Paracelsus—find out you’re out and about playing hero,”</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">It was only a small flight of stairs, but it felt like an eternity had passed when he finally reached his bed. As Sarmenti went for the door, he turned around once more.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">“Y’know, I’m not a praying man Barry, but maybe Junia and them folk are onto something there? Don’t know if you heard, but yesterday was nothing short of a miracle: nary a single one of us died. Those thieves spent their blood and bombs, and they couldn’t even get a single one of the townsfolk! Heard that one of ‘em even died to that old caretaker who was in the tavern when it all went down!”</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">The fool erupted into a cackle as he finally left the room, but Barristan could still hear the madman from his window, still laughing as he walked away from the Sanitarium. A smile formed across the old commander’s face as an immense weight began to fall upon his eyelids. </span></p>\n<p><span style=\"font-weight: 400;\"> </span><i><span style=\"font-weight: 400;\">Retirement can wait</span></i><span style=\"font-weight: 400;\">, he thought to himself before the world faded once more into that sweet and peaceful blackness.</span></p>",
            "author": {
                "name": "Funbunggo"
            },
            "tags": [
            ],
            "date_published": "2024-11-03T00:59:41+08:00",
            "date_modified": "2024-11-03T00:59:41+08:00"
        },
        {
            "id": "https://funbunggo.github.io/funbunggo/slow-and-insidious-deaths.html",
            "url": "https://funbunggo.github.io/funbunggo/slow-and-insidious-deaths.html",
            "title": "Slow and Insidious Deaths",
            "summary": "This story was originally intended for The Mountains &amp; the Valleys zine, but unfortunately I had not finished the story in time. Franz and Henryk stepped from the shadows into the amber glow of the firelight, their footsteps landing softly upon the cold stone and&hellip;",
            "content_html": "<p class=\"align-center\"><span style=\"text-decoration: underline;\"><em>This story was originally intended for The Mountains &amp; the Valleys zine, but unfortunately I had not finished the story in time.</em></span></p>\n<p><span style=\"font-weight: 400;\">Franz and Henryk stepped from the shadows into the amber glow of the firelight, their footsteps landing softly upon the cold stone and masked by the crackle of the flame. Franz removed his gaze from the dormant bodies surrounding the campfire and turned his head back towards the chamber’s entrance; even in the stygian darkness he recognized the lithe and fidgety form of Uriah beside the hulking figure of Boris, who stood a foot above most men and at twice their bulk. His eyes returned to the fools ahead, a xanthous grin forming across his face as they drew closer. Franz counted three sleeping bodies alongside an unfurled bedroll and a coffer from which the soft glisten of poorly concealed treasure winked at him. Though his gaze remained firmly on their loot, he could not help but question the state of their quarry and what this strange party sought in these aged and dusty ruins. </span></p>\n<p><span style=\"font-weight: 400;\">The rag-and-chain dress of one of the men, as well as the coin and jewels in their possession told Franz that much like himself and his companions, these fellows sought the riches of the ancient dead. But he recognized the beaked mask of a physician and the robes of a foreign mystic, which could have meant a less avaricious pursuit was at hand. And for what reason had they brought a spare bedroll? Or was it meant for another who had been felled by the things that lurked in the shadows? Perhaps—</span></p>\n<p><span style=\"font-weight: 400;\">Suddenly, his thoughts were shaken by the draconic roars of a discharged pistol and blunderbuss that echoed from the chamber’s entrance. As Franz turned to face the commotion, a thunderous blast of noise and radiance filled the air and revealed the scene in the hall. The light had been fleeting, though he was certain of what he had seen. Boris held one hand above his eyes, the other raised in a defiant but futile effort of self defense. His opponent was no walking corpse nor flesh-warped cultist; it was certainly a man and yet he could not discern any humanity beneath its steel gaze and dark attire. They were visible for but a moment, yet Boris’ screams—cut short and culminating in a wet thump—had been enough to illustrate a grisly scene in Franz’ head.</span></p>\n<p><span style=\"font-weight: 400;\">“Plan’s gone amuck boss, what now?” asked Henryk, daggers drawn and raised in a tense grip.</span></p>\n<p><span style=\"font-weight: 400;\">The rest of this dastardly crew had arisen from their slumber. His widened eyes met the foreigner’s iron gaze; it was a blank slate with neither fear of death nor hatred for his assailants writ upon it, instead bearing the cold stare that made Franz feel as if he’d peered into the abyss itself. His mind steeped in dread, he failed to sidestep the chirurgeon’s glass which shattered upon impact with his arm. Though the shards could not pierce his sleeves, the acid hissed as it tore through the cloth and ate away at his flesh. Franz allowed himself only the comfort of an anguished grunt through his gritted yellow teeth.</span></p>\n<p><span style=\"font-weight: 400;\">He could hear the foreigner begin to drone in a strange language that was alien but not in the way the robed man himself was; the harsh syllables were strung together in a tongue that was harsh to the ears and almost certainly not of man. As he continued his vile chanting, the campfire dimmed and the ground beneath Henryk parted like a torn fabric and revealed not dirt but a strange carmine void as if reality itself had been torn asunder to reveal the unearthly substratum beneath. In one fell motion, he raised his skull-lantern and as he did tentacles rose from the tear and wrapped themselves tightly around poor Henryk. The bandit struggled and thrashed against their eldritch grip, but naught was achieved save for the squandering of his vigor; bondaged and exhausted, he could do little more than scream as an unsightly scene began to play out in front of them both.</span></p>\n<p><span style=\"font-weight: 400;\">An anguished howl erupted from the chain-wrapped madman, his hands clutching his head as if it were soon to burst. His veins took on a sickly yellow hue as his skin turned a hellish red. Horns began to sprout, tearing through his scalp in a bloody ebullition of skin and hair. What was but a mere moment ago a wretched and craven looking man was now some misshapen devil, fangs dripping with a strange ichor as it set its bestial gaze upon Franz. His wits had fled him, and his legs failed to take after them as the monstrous thing threw itself toward him and sent him flying out of the chamber and into the darkness of the hallway, crashing first into the stone wall before falling limp upon wet flesh.</span></p>\n<p><span style=\"font-weight: 400;\">Franz hadn’t opened his eyes, and yet from the size of it he already knew whose corpse he had landed on. His entire body was enveloped in a throbbing ache while a sharper pain stabbed through his chest and elbow that only worsened as he scrambled to lift himself up from Boris’ corpse. The ring of steel upon steel echoed in his ears as he witnessed the silhouettes of Uriah and the helmed man clashed, the gunman catching each of his assailant’s blows with the barrel of his blunderbuss.</span></p>\n<p><span style=\"font-weight: 400;\">Boris was dead with Henryk soon to follow, and Franz was far too wounded to help Uriah fend off the three others who would soon emerge from the chamber to help their companion. Treasure and riches be damned, if he stayed now it would only afford him passage into hell. Mustering the remnants of his vitality, the wounded brigand broke into a mad dash, knocking into a body he hoped wasn’t Uriah’s. He stumbled as he ran, but never lost speed as he sprinted headlong into the darkness, hands outstretched so that he may feel the walls and corners before crashing into them. It wasn’t until he noticed the stars above him that he began to slow down, the adrenaline wearing off and giving way to a burning sensation in his legs. He groped around aimlessly, finding neither wall nor column in his surroundings and finally Franz allowed himself the luxury of collapse upon the cold hard ground beneath him.</span></p>\n<p><span style=\"font-weight: 400;\">As he stared into the void, he wondered to himself if it was a seasonal phenomena that gave the night’s sky its purple hue. The answer revealed itself in a distant wailing, inhuman and most certainly not even of this world. With neither the strength nor will to rise and fight, or even lift his head and face his doom, Franz reached for the dagger in his belt and pressed the cold metal against his throat. He was certain that for his sins he was to spend a thousand lifetimes burning in the Light’s flame, but even an eternity of fire seemed more merciful than even another second of this abyss.</span></p>\n<p><span style=\"font-weight: 400;\">“Light take me, please” he whispered, closing his eyes as he sealed his fate in one swift and final motion.</span></p>",
            "author": {
                "name": "Funbunggo"
            },
            "tags": [
            ],
            "date_published": "2024-11-03T00:55:53+08:00",
            "date_modified": "2024-11-03T00:55:53+08:00"
        }
    ]
}
